tap "AdoptOpenJDK/openjdk"

# Mac App Store command-line interface
brew "mas"

# manage dotfiles
brew "stow"

# terminal multiplexer
brew "tmux"

# best editor
brew "neovim"

# best vcs
brew "git"

# awesome cli fuzzy finder
brew "fzf"

# awesome JSON processor
brew "jq"

# kubernetes cli
brew "kubectl"

# fast/unobtrusive autosuggestions
brew "zsh-autosuggestions"

# Load/unload environment variables based on PWD
brew "direnv"

# execute a program periodically
brew "watch"

# node version manager
brew "nvm"

# install postgresql
brew "postgresql"

# `cat`, but with syntax highlighting and Git integration
brew "bat"

# fast search
brew "ripgrep"

# install node.js & npm
brew "node"

# install yarn for js
brew "yarn"

# Install python
brew "python3"

# Install Ruby
brew "ruby"

# Ruby environment tool
brew "chruby"

# Install Kotlin
brew "kotlin"

# Build automation tool
brew "gradle"

# node version manager
brew "n"

# a viewer for git and diff output
brew "git-delta"

# ----- Casks -----

# Basic tools
cask "google-chrome"
cask "brave-browser"
cask "iterm2"
cask "slack"
cask "spotify"
cask "zoomus"
cask "1password"
cask "visual-studio-code"
cask "docker"

# IDEs
cask "intellij-idea-ce"
cask "datagrip"

# Prebuilt OpenJDK Binaries
cask "adoptopenjdk"
cask "adoptopenjdk12"
